---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotEndWithZeroRiser
source: html/aef1d11e-de2f-4848-54c4-3e92455bc1dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotEndWithZeroRiser Property

Can't end Stairs with Riser because Riser Thickness is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEndWithZeroRiser { get; }
```